Repository: NeuralNinjas-AI/AirQuality
Catalog: Datasets/archive/ELRC_417_Parallel texts from Swedish Work environment/ELRC_417_Parallel texts from Swedish Work environment [...]_dataset/261.en-sv.tmx
Source language: en
Languages: sv

source: A floor drain should not be positioned where people stand working.
sv: Golvbrunnar bör inte placeras där man står och arbetar.

source: Floor drains that need cleaning often should be easily accessible.
sv: Golvbrunnar som behöver rensas ofta bör vara lätt åtkomliga.

source: 1:50-1:100 is a suitable slope round a floor drain.
sv: Lämplig golvlutning mot golvbrunn är 1:50–1:100.

source: Methods for assessment of reactions in humans on contact with hot and cold surfaces are contained in the standards SS-EN ISO 13732-1:2006 and ISO 13732-3:2005 respectively.
sv: Till 37 § Metoder för bedömning av reaktioner hos människan vid kontakt med varma respektive kalla ytor anges i standarderna SS-EN ISO 13732- 1:2006 respektive ISO 13732-3:2005.

source: The Building Regulations issued by the National Board of Housing, Building and Planning contain requirements for hot sections of buildings or installations.
sv: Boverkets byggregler innehåller krav på heta delar av byggnader eller installationer.

source: Working heights in day nurseries, out-of-school centres, pre-school classes and schools should be made suitable for both adults and pupils/children.
sv: I förskolor, fritidshem, förskoleklasser och skolor bör arbetshöjder vara lämpliga både för vuxna och elever/barn.

source: Every child’s department of a day nursery, therefore, should also have adult-sized tables and chairs.
sv: I varje barnavdelning inom förskolan bör det därför också finnas bord och stolar i vuxenhöjd.

source: Children's cloakrooms need seats for children and for adults.
sv: I barnens kapprum behövs sittplatser för barn och vuxna.

source: In schools the dining room counter for food collection, the tray return point, computer workplaces and safety equipment, for example, should also be adapted to suit the youngest children.
sv: I skolan bör exempelvis matsalens disk för mathämtning, platsen för brickinlämning, datorarbetsplatsen och skyddsutrustningen vara anpassade även för de yngsta barnen.

source: Checkout work and hairdressing are examples of work which it should be possible to do in both sitting and standing positions.
sv: Kassaarbete och frisörarbete är exempel på arbeten som bör kunna utföras både sittande och stående.

source: Hairdressing salons should have a work chair for jobs which can be done sitting or half-sitting.
sv: I frisörsalonger bör en frisörstol finnas för arbeten som kan utföras sittande eller halvsittande.

source: This can be counteracted by furnishings and equipment designed or positioned in such a way as to invite movement and variety.
sv: Inredning och utrustning som genom sin utformning eller placering inbjuder till rörelse och variation kan motverka detta.

source: A work table or balance table which can be raised and lowered electrically may be a suitable kind of equipment.
sv: Lämplig utrustning kan vara elektriskt höj- och sänkbara arbetsbord eller balansbord.

source: See also the Work Environment Authority's provisions about load ergonomics.
sv: Se även Arbetsmiljöverkets föreskrifter om belastningsergo- nomi.

source: Furnishings and equipment should be chosen and positioned so as to entail the least possible exposure to air contaminants.
sv: Inredning och utrustning bör väljas och placeras så att de medför så låg exponering för luftföroreningar som möjligt.

source: Equipment emitting, for example, heat, contaminants or disruptive noise (printers and copying machines) should not be positioned in the same rooms as permanent workplaces.
sv: Utrustning som avger exempelvis värme, föroreningar eller störande ljud bör inte placeras i samma - lokaler som permanenta arbetsplatser.

source: Furnishings and equipment should be easily cleaned and designed to avoid collecting dust.
sv: Inredning och utrustning bör vara lättstädad och utformad så att damm- samling undviks.

source: When choosing and placing equipment, the risk of burns should be taken into consideration.
sv: Vid val och placering av utrustning bör risken för brännskador beaktas.

source: Methods for assessing reactions in humans on contact with hot surfaces are contained in the standard SS-EN ISO 13732-1:2006.
sv: Metoder för bedömning av reaktioner hos människan vid kontakt med varma ytor anges i standarden SS-EN ISO 13732-1:2006.

source: For other activities it may be suitable to choose flooring with the right resilience for reducing the strain on the feet, legs and back.
sv: Vid andra verksamheter kan det vara lämpligt att välja golvbeläggning med lagom svikt för att minska påfrestningen på fötter, ben och rygg.

source: It is important for flooring material to be adapted to the mechanical and chemical influences to which it is subjected.
sv: Det är viktigt att golvmaterial är anpassat till den mekaniska och kemiska påverkan det utsätts för.

source: Uneven floors entail a risk of tripping and add to the difficulty of cleaning.
sv: Ojämna golvytor medför risk för snubbling och försvårar städning.

source: Sloping floors entail a heightened risk of slipping and tripping when walking and of trolleys or other equipment being inadvertently set in motion.
sv: Lutande golv medför ökad risk för halkning och snubbling vid gång, och för att vagnar eller inredning kommer i icke avsedd rörelse.

source: It is advisable for the floor round individual permanent workplaces to have no slope (i.e. to be horizontal or “flat”) for the avoidance of unsuitable work postures.
sv: Vid de enskilda fasta arbetsplatserna är det lämpligt att golvet är utan lutning (även benämnt horisontellt eller ”plant”) för att olämplig arbetsställning ska kunna undvikas.

source: Differences of floor level should be avoided as far as possible in the same room and between different rooms on the same storey.
sv: Nivåskillnader bör så långt möjligt undvikas inom samma lokal och mellan olika lokaler inom samma våningsplan.

source: If a difference in level is unavoidable, a ramp between the two levels is preferable to steps.
sv: Om nivåskillnad inte går att undvika är det lämpligare att den tas upp med ramp än med trappsteg.

source: The slope of a ramp should not exceed 1:12 and the difference in height between landings should not exceed 0.5 m.
sv: Ramp bör ha lutning högst 1:12 och höjdskillnad högst 0,5 m mellan vil- plan.

source: Insulation to the floor may sometimes be needed at permanent workplaces in chilled premises, and can be done using different types of pallets or similar.
sv: Isolering mot golv kan ibland behövas vid stationära arbetsplatser i kylda lokaler och kan utföras med olika typer av trallar eller liknande.

source: Measures to prevent this include, for example, semi-conductive floors and antistatic shoes for the prevention of igniting sparks from electrostatic discharges.
sv: Exempel på åtgärder mot detta är s.k. halvledande golv och antistatiska skor för att undvika tändande gnistor vid urladdning.

source: Recommendations concerning protection from static electricity by earthing or equipotential bonding are contained in the standard SS 421 08 22 (1).
sv: Råd om skydd mot statisk elektricitet genom jordning eller potentialutjämning finns i svensk standard SS 421 08 22 (1).

source: It is especially important that floors should be easy to clean.
sv: Det är särskilt viktigt att golven är lätta att rengöra.

source: The risk of slipping also needs to be taken into account in the selection of flooring materials.
sv: Även halkrisk behöver beaktas vid val av golvmaterial.

source: It is important to choose surfacing of such kinds that cleaning can be done using methods and cleaning agents which entail the least possible
sv: Det är viktigt att välja sådana ytskikt att rengöringen kan utföras med metoder och rengöringsmedel som innebär minsta möjliga risker för t.ex. belastningsskador, allergier, eksem osv. för städpersonalen.

source: When selecting surface coatings for floors, walls and ceilings, it is important to consider the risk of disorders – allergies, for example – which the materials in themselves can present to persons frequenting the premises.
sv: Vid val av ytbeklädnader på golv, väggar och tak är det viktigt att beakta den risk för de besvär, t.ex. allergiska, som materialen i sig kan medföra för dem som vistas i lokalen.

source: Certain methods of floor cleaning can entail technical requirements concerning other building elements.
sv: Vissa metoder för rengöring av golv kan medföra tekniska krav på andra byggnadsdelar.

source: Screening measures include, for example, facade screens, awnings, blinds, heat-reflecting glass and curtains.
sv: Exempel på avskärmning är fasad- skärmar, markiser, persienner, värmereflekterande glas och gardiner.

source: External screening, e.g. an awning, normally has the best effect.
sv: Utvändig avskärmning, t.ex. markis, ger normalt bästa verkan.

source: Arrangements such as fixed, i.e. non-variable, sunscreens should be avoided.
sv: Utförande som fast solavskärmning, dvs. sådan som inte kan regleras, bör undvikas.

source: Roof lanterns and skylights should be positioned in such a way that direct solar radiation is avoided as far as possible.
sv: Lanterniner och takfönster bör vara så placerade att direkt solstrålning i möjligaste mån undviks.

source: Roof cupolas may need to be partly screened off.
sv: Takkupol kan delvis behöva avskärmas.

source: One potential danger of open windows, for example, is that they may not be observed by passers by or else encroach on working space.
sv: Exempel på fara till följd av uppställda fönster är att de inte observeras vid passage eller inkräktar på arbetsutrymme.

source: Open windows with low sills can entail a risk of falls.
sv: Fönster med låg bröstning kan i uppställt läge innebära en risk för fall.

source: In schools this constitutes a particular risk for the youngest pupils.
sv: I skolan utgör detta en särskild risk för de yngsta eleverna.

source: This Provision means that it must be possible for the work to be done with a maximum of safety for both window cleaners and other persons present.
sv: Föreskriften innebär att arbetet ska kunna utföras på ett så säkert sätt som möjligt för både fönsterputsare och andra närvarande.

source: For safe cleaning and maintenance, it is advisable that windows that can be opened should open inwards.
sv: För att rengöring och underhåll av fönster ska kunna utföras säkert är det lämpligt att öppningsbara fönster är inåtgående.

source: Outward-opening windows, fixed windows and sections of glazing cleaned from the outside are examples of situations where special devices may be needed for safe cleaning.
sv: Utåtgående fönster, fasta fönster och glaspartier som rengörs från utsidan är exempel på när särskilda anordningar kan behövas för säker rengöring.

source: Devices of this kind include, for example, a gangway, anchorings for a safety device or personal fall protection equipment.
sv: Exempel på anordningar är gångbrygga eller fästen för skyddsanordning -eller personlig fallskyddsutrustning.

source: Glass roofing is another instance where special devices are normally needed in order for cleaning to be done safely, both inside and out.
sv: Andra glasytor som t.ex. glastak är också exempel på när särskilda anordningar normalt behövs för att rengöring ska kunna ske säkert, både in- och utvändigt.

source: It is important that the risk of falls should also be considered with regard to inward-opening windows positioned low down, i.e. with a low sill or none at all.
sv: Det är viktigt att risken för nedstörtning beaktas även vid inåtgående fönster som är lågt placerade, dvs. med låg eller ingen bröstning.

source: Suitable doors and gates provide good, communications that are easy to grasp, are safe and convenient to pass through, afford access for trolleys and wheelchairs and do not involve any risk of persons getting shut in.
sv: Till 46 § Lämpligt utförda och placerade dörrar och portar ger goda och överskådliga samband, är säkra och bekväma att passera, medger transport med vagn och passage med rullstol och medför inte risk för instängning.

source: A door on a traffic route should be easy to fasten in an open position for safe, convenient passage with a trolley or load.
sv: Dörr i transportväg bör vara utförd så att den är lätt att öppna och på ett enkelt sätt kunna ställas upp för säker och bekväm passage med vagn eller börda.

source: It is important that doors should be positioned and designed in such a way that they will not cause crush injuries when closed or by striking against other doors.
sv: Det är viktigt att dörrar placeras och utförs så att de inte orsakar klämskador vid stängning eller genom att slå emot andra dörrar.

source: The crush force should be less than 150 N.
sv: Klämkraften bör vara mindre än 150 N.

source: Doors between workroom and corridor, a pedestrian route or any other busy passage should be hung so as to open into the workroom, for the avoidance of collisions.
sv: Dörrar mellan arbetslokal och korridor, gångväg eller annan starkt trafi- kerad passage bör hängas så att de går inåt mot arbetslokalen för att sammanstötning ska undvikas.

source: Special rules exist concerning doors on escape routes.
sv: Om dörrar i utrymningsväg finns särskilda regler.

source: Fan room doors should be hung so as to open against any positive air pressure, i.e. into the fan room if it has positive pressure and outwards if the pressure inside the fan room is negative.
sv: Dörrar till fläktrum bör vara hängda så att de öppnas mot förekommande övertryck, dvs. vid fläktrum med övertryck inåt mot fläktrummet och vid undertryck ut från fläktrummet.

source: A large difference in air pressure may call for a special pressure equalisation device.
sv: Vid stor tryckskillnad kan särskild anordning för tryckutjämning behövas.

source: If doors have to have thresholds, it is important that these should be low.
sv: Om dörrar måste ha trösklar är det viktigt att dessa är låga.

source: On a traffic route there should be no thresholds, or else the thresholds should be low and present no obstacle to wheeled transport.
sv: I transportväg bör trösklar inte finnas eller vara låga och körbara för att inte hindra rullande transporter.

source: A threshold height exceeding 25 mm in a pedestrian doorway can be difficult for a trolley or wheelchair to negotiate and may also constitute a trip hazard.
sv: Tröskelhöjd över 15 mm i gångdörr kan innebära svårigheter vid passage med vagn eller rullstol och även utgöra snubbel- risk.

source: Provisions on mechanically operated doors are contained in the Building Regulations (BBR) of the National Board of Housing, Building and Planning.
sv: Om maskindrivna portar finns bestämmelser i Boverkets byggregler (BBR).

source: A pedestrian door normally needs to have a clear width of at least 0.7 m.
sv: Fri bredd för gångdörr behöver normalt vara minst 0,7 m.

source: For a wheelchair, a clear passage width of 0.8 m is normally needed, but for doors to smaller rooms for a few persons, such as offices and small group rooms, a clear passage of 0.76 is sufficient.
sv: För passage med rullstol behövs normalt fritt passagemått 0,80 m, men för dörrar till mindre rum för ett fåtal personer som kontorsrum och mindre grupprum räcker det med fritt pas- sagemått 0,76 m.

source: Clear passage is measured with the door open to 90°.
sv: Fritt passagemått räknas när dörren är uppställd i 90° .

source: A clear width of 0.8 m corresponds to standard door frame K 9 and a clear passage width of 0.76 m.
sv: Fri bredd 0,8 m motsvarar standardkarm K 9 och ett fritt passagemått på 0,76 m.

source: A clear width of 0.8 m for a pedestrian door is normally acceptable on an escape route.
sv: Fri bredd på 0,8 m för gångdörr kan normalt accepteras i utrymningsväg.

source: For passage by a loading pallet on a pallet jack, a free door width of at least 1.0-1.2 m is normally necessary, and for a pallet on a truck at least 1.4-1.6 m is normally needed.
sv: För passage med lastpall på lyftvagn behövs en fri dörrbredd av normalt minst 1,0–1,2 m och för pall på truck normalt minst 1,4–1,6 m.

source: Traffic routes, passages and corridors
sv: Transportvägar, gångar och korridorer

source: Traffic routes should be made flat, straight and short.
sv: Det är lämpligt att transportvägar görs plana, raka och korta.

source: It is important that space should be provided both for transport aids and for personnel, so that work can proceed in an ergonomically correct manner.
sv: Det är viktigt att utrymme finns för både transporthjälpmedel och personer, så att arbetet kan ske på ett ergonomiskt lämpligt sätt.

source: It is especially important that transport aids should be provided for heavy and bulky objects.
sv: Särskilt viktigt är att hiss eller lyftanordning finns för tunga och skrymmande föremål.

source: Where lighter loads are concerned, their number, frequency and size may also justify the use of a transport device instead of staircases.
sv: Vid hantering av lättare bördor kan även antal, frekvens och storlek motivera hiss eller lyftanordning i stället för trappa.

source: It is important that a lift or other transport device should have sufficient capacity and speed, so that it will actually be used.
sv: Det är viktigt att hiss eller annan lyftanordning har tillräcklig kapacitet och hastighet så att den kommer till användning.

source: Staircases are normally unsuitable as a transport route, due to the physical strain which they impose.
sv: Trappa är på grund av den fysiska belastningen normalt olämplig som transportled.

source: For safety reasons, spiral staircases are unsuitable for transport operations of all kinds, even those involving only light loads.
sv: Spiraltrappa är med hänsyn till säkerheten olämplig för alla slags transporter, även av lätta bördor.

source: Small differences in height can often be bridged by means of a ramp.
sv: Små höjdskillnader kan ofta tas upp med ramp.

source: The slope of the ramp should be adapted to the weights to be transported.
sv: Rampens lutning bör avpassas till de vikter som ska förflyttas.

source: A lift is normally needed between storeys.
sv: Mellan våningsplan behövs normalt hiss.

source: Other differences in height, smaller than those between storeys, may also warrant the provision of a lift or other transport device.
sv: Även andra höjdskillnader, mindre än mellan våningsplan, kan vara skäl till att hiss eller annan transportanordning behöver finnas.

source: With pedestrian traffic in both directions, a width of at least 1.2 m is generally needed.
sv: Om mötande gångtrafik förekommer behöver bredden i allmänhet ökas till minst 1,2 m.

source: A principal route usually needs to be wider still.
sv: Huvudgång behöver vanligen ha ytterligare större bredd.

source: Escape routes are proportioned in accordance with special rules.
sv: - Utrymningsvägar dimensioneras enligt särskilda regler.

source: Transport routes for one-way traffic usually need to be at least 0.6 m wider or, for traffic in both directions, 0.9 m wider than the vehicles using them, load included.
sv: Transportvägar behöver vanligen vid enkelriktad trafik vara minst 0,6 m bredare eller vid mötande trafik 0,9 m bredare än förekommande fordon inklusive last.

source: A width of at least 0.8 m is normally necessary for the passage of a cleaning trolley or cleaning machine.
sv: För passage med städvagn eller städmaskin behövs normalt minst 0,8 m.

source: Wheelchair passage normally requires at least 0.8 m.
sv: För passage med rullstol behövs normalt minst 0,8 m.

source: For turning a wheelchair, at least 1.3 m is normally needed.
sv: För vändning av rullstol behövs normalt minst 1,3 m.

source: These measurements refer to a manual or small electric indoor wheelchair.
sv: Dessa mått gäller manuell eller liten eldriven inomhusrullstol.

source: For turning an electric outdoor wheelchair, at least 1.5 m is required.
sv: För vändning med eldriven mindre utomhusrull- stol fordras minst 1,5 m.

source: A wheelchair ramp should have a slope not exceeding 1:12 and a vertical distance of not more than 0.5 m between landings.
sv: Ramp för rullstol bör ha lutning högst 1:12 och höjdskillnad högst 0,5 m mellan vilplan.

source: A clear height of at least 2.1 m is generally appropriate for pedestrian and transport routes.
sv: Det är i allmänhet lämpligt att fri höjd i gång- och transportvägar är minst 2,1 m.

source: Headroom of at least 0.2 m is usually needed above the highest vehicle occurring, load included.
sv: Det behövs vanligen ett fritt utrymme av minst 0,2 m över högsta -förekommande fordon inklusive last.

source: Separate girders, pipes and other vertically and horizontally projecting elements which are not readily noticeable should be provided with a warning sign for the avoidance of collisions.
sv: Enstaka balkar, rör och andra utskjutande element i höjd och sida som inte lätt uppmärksammas förses lämpligen med varselmärkning för att undvika sammanstötning.

source: Where, for safety reasons, pedestrian traffic needs to be separated from vehicles, e.g. on corners, the separation ought preferably be effected by means of a rail or some comparable protective device, and where necessary this should carry a warning sign.
sv: Där gångtrafik av säkerhetsskäl behöver vara avskild från fordon, t.ex. vid hörn, bör avskiljningen lämpligen ske genom räcke eller annan motsvarande skyddsanordning, som bör vara varselmärkt där det behövs.

source: Obstructive steps and thresholds, therefore, should not occur.
sv: Hindrande trappsteg och trösklar bör därför inte förekomma.

source: Both heavy transport operations and, for example, passage with cleaning trolleys need to be facilitated.
sv: Det är viktigt att underlätta både tyngre transporter och t.ex. passage med städvagnar.

source: On pedestrian routes, the risk of tripping is another reason for the avoidance of single steps.
sv: I gångvägar är även snubbelrisken ett skäl att undvika enstaka trappsteg.

source: Small differences in level and thresholds should also be avoided so as to facilitate transport operations and reduce the risk of tripping.
sv: Även mindre nivåskillnader och trösklar bör undvikas för att underlätta transporter och minska risken för snubbling.

source: If single steps cannot be avoided, the staircase ought normally to have at least three steps.
sv: Om enstaka trappsteg inte kan undvikas bör trappan normalt ha minst tre trappsteg.

source: Steps of this kind in a corridor should be provided with warning signs and lighting and, as a rule, ramps for trolleys, wheelchairs, etc.
sv: Sådana trappsteg i korridor bör förses med varselmärkning och belysning samt i regel körslänter för vagn, rullstol e.dyl.

source: A small difference in level is best bridged with a ramp instead of steps.
sv: Det är lämpligt att en liten nivåskillnad överbryggas med ramp istället för med trappsteg.

source: Stairs conforming to Swedish Standard SIS 91 11 01, Stairs – stair components – Basic sizes, are usually suitable.
sv: Trappor som är utförda enligt svensk standard SIS 91 11 01, Trappele- ment – grundläggande mått, är vanligen lämpliga.

source: It is important that there should be adequate clear height on stairs.
sv: Det är viktigt att den fria höjden i trappor är tillräcklig.

source: Stairs with more than three rises normally need to have a guard rail and handrail.
sv: Trappor som är högre än tre steghöjder behöver normalt ha räcke och ledstång.

source: The handrail is best positioned at a height of 0.9 m, measured from the nosing.
sv: Ledstång placeras lämpligen på en höjd av 0,9 m, mätt vid stegno- sen.

source: A handrail provides support but also serves to arrest a fall.
sv: Ledstång fungerar som stöd men också för att hejda ett påbörjat fall.
